{
    "projectData": [
        {
            "title": "QuizApp",
            "description": [
                "•Developed a comprehensive quiz creation and sharing platform with secure authentication.",
                "•Implemented features include quiz creation, editing, updating, deleting, sharing quizzes, real-time analytics, question timers, and trending quiz identification based on impressions.",
                "•Design front-end with React, back-end with Node.js and MongoDB Database."
            ],
            "technologies": [
                "React",
                "JavaScript",
                "NodeJs",
                "ExpressJs",
                "MongoDB"
            ],
            "link": "https://quiz-frontend-dun.vercel.app/"
        },
        {
            "title": "Task Mangager",
            "description": [
                "•Developed a Role based task management platform with secure authentication.",
                "•Admins can assign, track, update, approve, or reject tasks, while users check task status and details.",
                "•Design front-end with React, back-end with Node.js and MongoDB Database."
            ],
            "technologies": [
                "React",
                "JavaScript",
                "NodeJs",
                "ExpressJs",
                "MongoDB"
            ],
            "link": "https://task-manager-theta-coral.vercel.app/"
        },
        {
            "title": "SWipTory",
            "description": [
                "•Developed for storytelling platform with secure authentication.",
                "•Users can browse, read, like, bookmark, and share stories, with easy navigation through various categories.",
                "•Design front-end with React, back-end with Node.js and MongoDB Database."
            ],
            "technologies": [
                "React",
                "JavaScript",
                "NodeJs",
                "ExpressJs",
                "MongoDB"
            ],
            "link": "https://swiptory-chi.vercel.app/"
        },
        {
            "title": "Pocket Notes",
            "description": [
                "•Allows users to organize their notes efficiently.",
                "•Users can create customized groups for their notes.",
                "•Users can add notes to specific groups. Notes are saved in local storage.",
                "•The application automatically fetches relevant notes when users switch between groups."
            ],
            "technologies": [
                "React"
            ],
            "link": "https://pocket-notes-rouge-three.vercel.app/"
        },
        {
            "title": "Calculator App",
            "description": [
                "•Developed a simple calculator application using HTML, CSS, and JavaScript.",
                "•Implemented a user-friendly interface with buttons for numerical input, operators, and clear and calculate buttons."
            ],
            "technologies": [
                "Html",
                "CSS",
                "Javascript"
            ],
            "link": "https://parshyagk23.github.io/Calculator/"
        },
        {
            "title": "Super App",
            "description": [
                "• Provides a dynamic selection of entertainment categories for users to choose from.",
                "• Displays a showcase page with features such as:",
                "   A news section,A timer, User profile management, Personal notes,Current temperature details",
                "• Includes an intuitive Browse feature for accessing detailed movie information based on the selected category."
            ],
            "technologies": [
                "Html",
                "CSS",
                "Javascript",
                "React"
            ],
            "link": "https://supperapp-7a46b.web.app/"
        },
        {
            "title": "Weather Forcast Web Application",
            "description": [
                "• Enables users to search for current weather conditions by entering their country's or city's name.",
                "• Provides a sortable table that lists weather information by city, country, and time zone.",
                "• Includes clickable rows in the table, where selecting a specific row displays detailed weather conditions for the chosen city"
            ],
            "technologies": [
                "Html",
                "CSS",
                "Javascript",
                "React"
            ],
            "link": "https://weatherforecast-app-three.vercel.app/"
        }
    ]
}